<a href="https://colab.research.google.com/github/ARCTraining/python-2021-04/blob/alex-indexing/020_data_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Starting with Data

In [ ]:
# Author: Martin Callaghan
# Date: 2021-04-26
# Lesson link: https://arctraining.github.io/python-2021-04/02-starting-with-data/index.html

In [ ]:
# import pandas library
import pandas as pd

In [ ]:
# Connect my Google Drive to colab
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [ ]:
# We use the Portal Project teaching dataset
# https://figshare.com/articles/dataset/Portal_Project_Teaching_Database/1314459

In [ ]:
# But first we need to download it
!wget https://arctraining.github.io/python-2021-04/data/portal-teachingdb-master.zip

--2021-05-04 08:22:54--  https://arctraining.github.io/python-2021-04/data/portal-teachingdb-master.zip
Resolving arctraining.github.io (arctraining.github.io)... 185.199.110.153, 185.199.109.153, 185.199.108.153, ...
Connecting to arctraining.github.io (arctraining.github.io)|185.199.110.153|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 689547 (673K) [application/zip]
Saving to: ‘portal-teachingdb-master.zip’

portal-teachingdb-m 100%[===================>] 673.39K  --.-KB/s    in 0.02s

2021-05-04 08:22:54 (35.0 MB/s) - ‘portal-teachingdb-master.zip’ saved [689547/689547]

In [ ]:
! mv portal-teachingdb-master.zip data.zip

In [ ]:
# after downloading rename
# portal-teachingdb-master.zip to data.zip
# <<< do that in the file explorer window to the left of the notebook <<<

In [ ]:
# now unzip the file we've just downloaded
!unzip data.zip

Archive:  data.zip
   creating: portal-teachingdb-master/
  inflating: portal-teachingdb-master/surveys2001.csv
  inflating: portal-teachingdb-master/surveys2002.csv
  inflating: portal-teachingdb-master/speciesSubset.csv
  inflating: portal-teachingdb-master/bouldercreek_09_2013.txt
  inflating: portal-teachingdb-master/species.csv
  inflating: portal-teachingdb-master/surveys.csv
  inflating: portal-teachingdb-master/portal_mammals.sqlite
  inflating: portal-teachingdb-master/README.txt
  inflating: portal-teachingdb-master/plots.csv

In [ ]:
# rename the folder portal-teachingdb-master to data
# <<< do that in the file explorer window to the left of the notebook <<<

In [ ]:
# see what we have done
!ls -l

total 688
-rw-r--r-- 1 root root 689547 Apr 29 15:01 data.zip
drwx------ 6 root root   4096 May  4 08:15 gdrive
drwxrwxr-x 2 root root   4096 Jun  5  2020 portal-teachingdb-master
drwxr-xr-x 1 root root   4096 Apr 21 13:39 sample_data

In [ ]:
! mv data gdrive/MyDrive/Colab\ Notebooks/intro-python-2021-04

In [ ]:
# First look at the data
pd.read_csv ('gdrive/MyDrive/Colab Notebooks/intro-python-2021-04/data/surveys.csv')

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
0              1      7   16  1977  ...          NL    M            32.0     NaN
1              2      7   16  1977  ...          NL    M            33.0     NaN
2              3      7   16  1977  ...          DM    F            37.0     NaN
3              4      7   16  1977  ...          DM    M            36.0     NaN
4              5      7   16  1977  ...          DM    M            35.0     NaN
...          ...    ...  ...   ...  ...         ...  ...             ...     ...
35544      35545     12   31  2002  ...          AH  NaN             NaN     NaN
35545      35546     12   31  2002  ...          AH  NaN             NaN     NaN
35546      35547     12   31  2002  ...          RM    F            15.0    14.0
35547      35548     12   31  2002  ...          DO    M            36.0    51.0
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN

[35549 rows x 9 columns]

In [ ]:
# Read in the df and assign to a variable
surveys_df = pd.read_csv ('gdrive/MyDrive/Colab Notebooks/intro-python-2021-04/data/surveys.csv')

In [ ]:
# Quickly view the contents
surveys_df

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
0              1      7   16  1977  ...          NL    M            32.0     NaN
1              2      7   16  1977  ...          NL    M            33.0     NaN
2              3      7   16  1977  ...          DM    F            37.0     NaN
3              4      7   16  1977  ...          DM    M            36.0     NaN
4              5      7   16  1977  ...          DM    M            35.0     NaN
...          ...    ...  ...   ...  ...         ...  ...             ...     ...
35544      35545     12   31  2002  ...          AH  NaN             NaN     NaN
35545      35546     12   31  2002  ...          AH  NaN             NaN     NaN
35546      35547     12   31  2002  ...          RM    F            15.0    14.0
35547      35548     12   31  2002  ...          DO    M            36.0    51.0
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN

[35549 rows x 9 columns]

In [ ]:
# look at the fist few rows
surveys_df.head(3)

   record_id  month  day  year  plot_id species_id sex  hindfoot_length  weight
0          1      7   16  1977        2         NL   M             32.0     NaN
1          2      7   16  1977        3         NL   M             33.0     NaN
2          3      7   16  1977        2         DM   F             37.0     NaN

## Exploring the dataset

In [ ]:
# What is surveys_df
type(surveys_df)

pandas.core.frame.DataFrame

In [ ]:
# What data types are in the dataframe
surveys_df.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id              int64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
dtype: object

In [ ]:
# Challenge 1
surveys_df.columns

Index(['record_id', 'month', 'day', 'year', 'plot_id', 'species_id', 'sex',
       'hindfoot_length', 'weight'],
      dtype='object')

In [ ]:
surveys_df.shape

(35549, 9)

In [ ]:
surveys_df.tail()

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
35544      35545     12   31  2002  ...          AH  NaN             NaN     NaN
35545      35546     12   31  2002  ...          AH  NaN             NaN     NaN
35546      35547     12   31  2002  ...          RM    F            15.0    14.0
35547      35548     12   31  2002  ...          DO    M            36.0    51.0
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN

[5 rows x 9 columns]

## Basic statistics on the dataframe

In [ ]:
# Look at the columns
surveys_df.columns

Index(['record_id', 'month', 'day', 'year', 'plot_id', 'species_id', 'sex',
       'hindfoot_length', 'weight'],
      dtype='object')

In [ ]:
# What are the unique values of species
pd.unique(surveys_df['species_id'])

array(['NL', 'DM', 'PF', 'PE', 'DS', 'PP', 'SH', 'OT', 'DO', 'OX', 'SS',
       'OL', 'RM', nan, 'SA', 'PM', 'AH', 'DX', 'AB', 'CB', 'CM', 'CQ',
       'RF', 'PC', 'PG', 'PH', 'PU', 'CV', 'UR', 'UP', 'ZL', 'UL', 'CS',
       'SC', 'BA', 'SF', 'RO', 'AS', 'SO', 'PI', 'ST', 'CU', 'SU', 'RX',
       'PB', 'PL', 'PX', 'CT', 'US'], dtype=object)

In [ ]:
# Challenge 2: Statistics

In [ ]:
# Create a list of unique plot_id
site_names = pd.unique(surveys_df['plot_id'])

In [ ]:
site_names

array([ 2,  3,  7,  1,  6,  5,  8,  4, 11, 14, 15, 13,  9, 10, 17, 16, 20,
       23, 18, 21, 22, 19, 12, 24])

In [ ]:
# How many unique site names are there?
len (site_names)

24

In [ ]:
# Number of species
len (pd.unique(surveys_df['species_id']))

49

In [ ]:
# What is the difference between len(site_names) and surveys_df['plot_id'].nunique()?
surveys_df['plot_id'].nunique()

24

## Grouping in Pandas

In [ ]:
# Homework:
# Try the 'grouping in pandas' section *and* the Challenge - Summary Data

## Indexing and slicing with pandas

In [ ]:
a = [1, 2, 3, 4, 5]

In [ ]:
a[2]

3

In [ ]:
# view the available columns in the dataframe
surveys_df.columns

Index(['record_id', 'month', 'day', 'year', 'plot_id', 'species_id', 'sex',
       'hindfoot_length', 'weight'],
      dtype='object')

In [ ]:
# indexing out a whole column

# here we get an error because we're trying to index into the special .columns attribute
surveys_df.columns['hindfoot_length']

IndexError: ignored

In [ ]:
# we can slice out a column using square brackets and the string of the column name
surveys_df['hindfoot_length']

0        32.0
1        33.0
2        37.0
3        36.0
4        35.0
         ...
35544     NaN
35545     NaN
35546    15.0
35547    36.0
35548     NaN
Name: hindfoot_length, Length: 35549, dtype: float64

In [ ]:
# here we sliced out the column name from the .columns attribute 
# but not the values of the column itself
surveys_df.columns[-2]

'hindfoot_length'

In [ ]:
# we can also use dot notation to index out a single column
surveys_df.hindfoot_length

0        32.0
1        33.0
2        37.0
3        36.0
4        35.0
         ...
35544     NaN
35545     NaN
35546    15.0
35547    36.0
35548     NaN
Name: hindfoot_length, Length: 35549, dtype: float64

In [ ]:
# indexing out multiple columns means passing a list 
# to the index brackets 
surveys_df[['hindfoot_length','month']]

       hindfoot_length  month
0                 32.0      7
1                 33.0      7
2                 37.0      7
3                 36.0      7
4                 35.0      7
...                ...    ...
35544              NaN     12
35545              NaN     12
35546             15.0     12
35547             36.0     12
35548              NaN     12

[35549 rows x 2 columns]

In [ ]:
# we can also do this by assigning a list as a variable
# and passing the variable to the index brackets

desired_cols = ['hindfoot_length','month']

surveys_df[desired_cols]

       hindfoot_length  month
0                 32.0      7
1                 33.0      7
2                 37.0      7
3                 36.0      7
4                 35.0      7
...                ...    ...
35544              NaN     12
35545              NaN     12
35546             15.0     12
35547             36.0     12
35548              NaN     12

[35549 rows x 2 columns]

In [ ]:
# indexing a column name that does not exist gives an error
surveys_df['name']

KeyError: ignored

In [ ]:
surveys_df.head()

   record_id  month  day  year  plot_id species_id sex  hindfoot_length  weight
0          1      7   16  1977        2         NL   M             32.0     NaN
1          2      7   16  1977        3         NL   M             33.0     NaN
2          3      7   16  1977        2         DM   F             37.0     NaN
3          4      7   16  1977        7         DM   M             36.0     NaN
4          5      7   16  1977        3         DM   M             35.0     NaN

In [ ]:
# we can also use .iloc and .loc to index rows, columns 
# .iloc index by integer location
# index out the row at the 0th index
surveys_df.iloc[0]

record_id             1
month                 7
day                  16
year               1977
plot_id               2
species_id           NL
sex                   M
hindfoot_length      32
weight              NaN
Name: 0, dtype: object

In [ ]:
# here we've indexed the first 3 rows of the 6th column
surveys_df.iloc[0:3,7]

0    32.0
1    33.0
2    37.0
Name: hindfoot_length, dtype: float64

In [ ]:
# .loc indexes by labels
# here we've indexed from rows 0 to 3 (by label)
# at the 'hindfoot_length' column
surveys_df.loc[0:3,'hindfoot_length']

0    32.0
1    33.0
2    37.0
3    36.0
Name: hindfoot_length, dtype: float64

In [ ]:
# using iloc to index the first three rows and columns
surveys_df.iloc[0:3, 0:3]

   record_id  month  day
0          1      7   16
1          2      7   16
2          3      7   16

In [ ]:
# we can make a copy of a subsetted data frame by using .copy()
# this creates a separate object from our original dataframe surveys_df
copy_of_first3 = surveys_df.iloc[0:3, 0:3].copy()

In [ ]:
# this notation just creates a reference to the original dataframe
# so any changes we make to copy_of_first3 are actually made to the originak
# surveys_df dataframe
copy_of_first3 = surveys_df.iloc[0:3, 0:3]

In [ ]:
# we can also perform a vectorised boolean comparison and 
# return a boolean array
surveys_df['species_id'] == 'NL'

0         True
1         True
2        False
3        False
4        False
         ...
35544    False
35545    False
35546    False
35547    False
35548    False
Name: species_id, Length: 35549, dtype: bool

In [ ]:
# we can use this to subset the dataframe for a specific species 
subset_df = surveys_df[surveys_df['species_id'] == 'NL'].copy()

In [ ]:
# we can also do this in two lines by assign a bool_mask variable
bool_mask = surveys_df['species_id'] == 'NL'

surveys_df[bool_mask]

       record_id  month  day  year  ...  species_id sex hindfoot_length  weight
0              1      7   16  1977  ...          NL   M            32.0     NaN
1              2      7   16  1977  ...          NL   M            33.0     NaN
21            22      7   17  1977  ...          NL   F            31.0     NaN
37            38      7   17  1977  ...          NL   M            33.0     NaN
71            72      8   19  1977  ...          NL   M            31.0     NaN
...          ...    ...  ...   ...  ...         ...  ..             ...     ...
35403      35404     12   29  2002  ...          NL   F            30.0     NaN
35414      35415     12   29  2002  ...          NL   F            33.0   200.0
35434      35435     12   29  2002  ...          NL   F            31.0   150.0
35458      35459     12   29  2002  ...          NL   F            29.0   148.0
35478      35479     12   29  2002  ...          NL   M            32.0   224.0

[1252 rows x 9 columns]

In [ ]:
subset_df.head()

    record_id  month  day  year  ...  species_id sex hindfoot_length  weight
0           0      7   16  1977  ...          NL   M            32.0     NaN
1           0      7   16  1977  ...          NL   M            33.0     NaN
21          0      7   17  1977  ...          NL   F            31.0     NaN
37         38      7   17  1977  ...          NL   M            33.0     NaN
71         72      8   19  1977  ...          NL   M            31.0     NaN

[5 rows x 9 columns]

In [ ]:
# if you want to update your indexes on a subset
# subset_df.reset_index(inplace=True)

In [ ]:
# we can set values of rows when indexing 
# but this can be quite dangerous so be careful
subset_df.iloc[0:3, 0] = 0

In [ ]:
# checking the changes
subset_df.iloc[0:3]

    record_id  month  day  year  ...  species_id sex hindfoot_length  weight
0           0      7   16  1977  ...          NL   M            32.0     NaN
1           0      7   16  1977  ...          NL   M            33.0     NaN
21          0      7   17  1977  ...          NL   F            31.0     NaN

[3 rows x 9 columns]

In [ ]:
# we can use subsetting to generate quick summary data
surveys_df[surveys_df['species_id'] == 'ZL'].count()

record_id          2
month              2
day                2
year               2
plot_id            2
species_id         2
sex                0
hindfoot_length    0
weight             0
dtype: int64

In [ ]:
surveys_df[surveys_df['species_id'] == 'ZL']

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
14249      14250      3   20  1988  ...          ZL  NaN             NaN     NaN
14350      14351      4   17  1988  ...          ZL  NaN             NaN     NaN

[2 rows x 9 columns]

In [ ]:
# we can also subset by multiple boolean values
# using the `&` AND operator here which checks whether both conditions are True
# we can use `|` OR operator to check if one of the two is True
surveys_df[(surveys_df.year >= 1980) & (surveys_df.year <= 1985)]

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
2270        2271      1   15  1980  ...          DO    M            35.0    53.0
2271        2272      1   15  1980  ...          PF    F            16.0    10.0
2272        2273      1   15  1980  ...          DM    F            34.0    33.0
2273        2274      1   15  1980  ...          DM    M            38.0    37.0
2274        2275      1   15  1980  ...          DO    F            33.0    29.0
...          ...    ...  ...   ...  ...         ...  ...             ...     ...
11222      11223     12    8  1985  ...          DM    M            36.0    40.0
11223      11224     12    8  1985  ...          DM    M            37.0    49.0
11224      11225     12    8  1985  ...          PE    M            20.0    18.0
11225      11226     12    8  1985  ...          DM    M            38.0    47.0
11226      11227     12    8  1985  ...         NaN  NaN             NaN     NaN

[8957 rows x 9 columns]